{"format": "graph-model", "generatedBy": "1.15.4", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"Image:0": {"name": "Image:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}}, "outputs": {"62cfdd88-22bb-4601-8fbf-dc96ae2dcd12.cc3455b9-54e6-4a06-a65d-97205ca63ce4/dense_2/Softmax:0": {"name": "62cfdd88-22bb-4601-8fbf-dc96ae2dcd12.cc3455b9-54e6-4a06-a65d-97205ca63ce4/dense_2/Softmax:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "Image", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "224"}, {"size": "224"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/global_max_pooling2d/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}, {"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/tf_op_layer_Mul/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/tf_op_layer_Sub/Sub/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1_pad/Pad/paddings", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}, {"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/Conv_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "320"}, {"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_14_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_14_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_14_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_14_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/Conv_1/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1280"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_14_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "144"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "144"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "144"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_15_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_15_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_15_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_15_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_15_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_15_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_9_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_9_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_16_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_9_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_9_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_9_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_9_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_10_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_16_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_10_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_10_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_10_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_10_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_10_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_11_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_16_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "960"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_11_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_11_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_11_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_11_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_16_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_11_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_12_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_12_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_12_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_12_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_12_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_16_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "960"}, {"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_12_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_13_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_13_expand/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_16_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "320"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_13_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "576"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_13_depthwise/depthwise_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "576"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_13_project/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "576"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_13_project/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_14_expand/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "160"}, {"size": "960"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/tf_op_layer_Mul/Mul", "op": "Mul", "input": ["Image", "saved_mobilenet_model/tf_op_layer_Mul/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/tf_op_layer_Sub/Sub", "op": "Sub", "input": ["saved_mobilenet_model/tf_op_layer_Mul/Mul", "saved_mobilenet_model/tf_op_layer_Sub/Sub/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/tf_op_layer_Sub/Sub", "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {"i": ["0", "0", "0", "1", "0", "1", "0", "0"]}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "RVhQTElDSVQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/Conv1_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/expanded_conv_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_pad/Pad", "op": "Pad", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_1_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_1_pad/Pad", "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_1_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_2_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_2_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_add/add", "op": "AddV2", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_1_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_2_project_BN/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_2_add/add", "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_pad/Pad", "op": "Pad", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_3_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_3_pad/Pad", "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_3_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_4_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_4_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_add/add", "op": "AddV2", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_3_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_4_project_BN/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_4_add/add", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_5_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_5_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_add/add", "op": "AddV2", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_4_add/add", "saved_mobilenet_model/mobilenetv2_1.00_224/block_5_project_BN/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_5_add/add", "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_pad/Pad", "op": "Pad", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_6_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/Conv1_pad/Pad/paddings"], "attr": {"T": {"type": "DT_FLOAT"}, "Tpaddings": {"type": "DT_INT32"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_6_pad/Pad", "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "VkFMSUQ="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_6_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_7_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_depthwise/depthwise_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_depthwise/depthwise_bn_offset"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_project_BN/FusedBatchNormV3", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_7_depthwise/depthwise", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_project/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_project/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_add/add", "op": "AddV2", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_6_project_BN/FusedBatchNormV3", "saved_mobilenet_model/mobilenetv2_1.00_224/block_7_project_BN/FusedBatchNormV3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_expand_relu/Relu6", "op": "_FusedConv2D", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_7_add/add", "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_expand/Conv2D_weights", "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_expand/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}}}, {"name": "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_depthwise/depthwise", "op": "FusedDepthwiseConv2dNative", "input": ["saved_mobilenet_model/mobilenetv2_1.00_224/block_8_expand_relu/Relu6", "saved_mobilenet_model/mobilenetv2_1.00_224/block_8_depthwise/depthwise_weights", 